/********************************************************************************
    * 文件名称 ：E53_IS1.h
    * 作     者：小熊派开源社区
    * 版     本：V1.0
    * 编写日期 ：2019-5-27
    * 功     能：E53_IS1扩展板驱动
*********************************************************************************
    * 说    明 ：本例程配套小熊派开源社区开发板使用
    *
    * 淘     宝：https://shop336827451.taobao.com/
    * 论     坛：https://bbs.huaweicloud.com/forum/forum-734-1.html
    * 微信公众号：小熊派开源社区
*********************************************************************************/
#ifndef __E53_IS1_H__
#define __E53_IS1_H__
#include "stm32l4xx_hal.h"

extern TIM_HandleTypeDef htim16;

/***************************************************************
* 名        称: GasStatus_ENUM
* 说    明：枚举状态结构体
***************************************************************/
typedef enum
{
    OFF = 0,
    ON
} E53_IS1_Status;

void E53_IS1_Init(void);
int E53_IS1_Read_Data(void);
void E53_IS1_Beep_Set(E53_IS1_Status status);

#endif





